/**
 * Автодополнение на JavaScript
 * Сейчас мы реализуем автодополнение. Под этим термином понимается выпадающая подсказка при вводе текста в инпут.
 * Давайте посмотрим на примере. Ниже я сделал инпут, в который можно ввести название страны.
 * При этом, если ввести какие-то буквы, то под инпутом появится список стран, которые начинаются на введенную строку.
 * При желании можно, чтобы не вводить целиком имя страны, кликнуть мышкой на любую страну и она появится в инпуте.
 * Для этого, в общем-то, автодополнение и нужно.
 */

