'use strict';

/**
 * Источник задачи https://code.mu/ru/javascript/book/practice/checklist/task-formulation/
 * Реализуем чеклист. Чеклистом называется программа, которая позволяет сделать список планируемых дел, 
 * а затем по мере выполнения этим дел отмечать эти дела сделанными. 
 * Давайте сделаем так, чтобы дела можно было добавлять, удалять, редактировать и отмечать сделанными. 
 * Вот образец того, что у нас должно получится (для ввода нового дела введите текст в инпут и нажмите Enter, 
 * для редактирования выполните двойной клик по тексту дела):
 */